nc: 4 # Number of classes: COVID-19, Pneumonia, Lung Opacity, Normal
depth_multiple: 0.5 # Mengurangi kedalaman untuk mengurangi parameter
width_multiple: 0.5 # Menurunkan lebar beberapa layer untuk efisiensi
activation: nn.SiLU() # Mengganti ReLU dengan SiLU untuk gradien yang lebih stabil

anchors: 3

# YOLOv11 Backbone yang dioptimalkan dengan Depthwise Separable Convolution dan FPN
backbone: [
    [-1, 1, nn.Identity, []],

    # conv down dengan depthwise separable convolution
    [-1, 1, DWConv, [48, 3, 2]], # 1-P1/2

    # conv down dengan depthwise separable convolution
    [-1, 1, DWConv, [96, 3, 2]], # 2-P2/4

    # Elan-1 block dengan parameter lebih sedikit
    [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]], # 3

    # conv down dengan depthwise separable convolution
    [-1, 1, DWConv, [192, 3, 2]], # 4-P3/8

    # Elan-2 block dengan parameter lebih sedikit
    [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]], # 5

    # conv down dengan depthwise separable convolution
    [-1, 1, DWConv, [256, 3, 2]], # 6-P4/16

    # Elan-2 block dengan parameter lebih sedikit
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 7

    # conv down dengan depthwise separable convolution
    [-1, 1, DWConv, [256, 3, 2]], # 8-P5/32

    # Elan-2 block
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 9
  ]

# YOLOv11 Head dengan FPN dan SPP yang dioptimalkan
head: [
    # SPP block yang dioptimalkan untuk multi-level feature extraction
    [-1, 1, SPPELAN, [256, 128]], # 10

    # up-concat merge dengan Feature Pyramid Network (FPN)
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 7], 1, Concat, [1]], # cat backbone P4

    # Elan-2 block dengan FPN untuk multi-scale features
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 13

    # up-concat merge
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P3

    # Elan-2 block
    [-1, 1, RepNCSPELAN4, [192, 192, 96, 1]], # 16 (P3/8-small)

    # conv-down merge
    [-1, 1, Conv, [192, 3, 2]],
    [[-1, 13], 1, Concat, [1]], # cat head P4

    # Elan-2 block
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 19 (P4/16-medium)

    # conv-down merge
    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P5

    # Elan-2 block
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 22 (P5/32-large)

    # detect
    [[16, 19, 22], 1, Detect, [nc]], # Use Detect
  ]
