nc: 4
depth_multiple: 0.75 # Mengurangi kedalaman untuk efisiensi
width_multiple: 0.75 # Mengurangi lebar untuk mengurangi parameter
activation: nn.LeakyReLU(0.1) # LeakyReLU untuk stabilitas gradien

anchors: 3

# YOLOv11 Backbone
backbone: [
    [-1, 1, nn.Identity, []],

    # conv down dengan depthwise separable convolution
    [-1, 1, DWConv, [48, 3, 2]], # 1-P1/2

    # conv down dengan depthwise separable convolution
    [-1, 1, DWConv, [96, 3, 2]], # 2-P2/4

    # elan-1 block dengan pengurangan parameter
    [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]], # 3

    # conv down dengan depthwise separable convolution
    [-1, 1, DWConv, [192, 3, 2]], # 4-P3/8

    # elan-2 block dengan pengurangan parameter
    [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]], # 5

    # conv down dengan depthwise separable convolution
    [-1, 1, DWConv, [256, 3, 2]], # 6-P4/16

    # elan-2 block dengan pengurangan parameter
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 7

    # conv down dengan depthwise separable convolution
    [-1, 1, DWConv, [256, 3, 2]], # 8-P5/32

    # elan-2 block
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 9
  ]

# YOLOv11 Head yang lebih efisien
head: [
    # Optimized SPP block for better spatial feature extraction
    [-1, 1, SPPELAN, [256, 128]], # 10

    # up-concat merge
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 7], 1, Concat, [1]], # cat backbone P4

    # elan-2 block
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 13

    # up-concat merge
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P3

    # elan-2 block
    [-1, 1, RepNCSPELAN4, [192, 192, 96, 1]], # 16 (P3/8-small)

    # conv-down merge
    [-1, 1, Conv, [192, 3, 2]],
    [[-1, 13], 1, Concat, [1]], # cat head P4

    # elan-2 block
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 19 (P4/16-medium)

    # conv-down merge
    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P5

    # elan-2 block
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 22 (P5/32-large)

    # detect
    [[16, 19, 22], 1, Detect, [nc]], # Use Detect
  ]
