nc: 4 # Number of classes (COVID-19, Pneumonia, Lung Opacity, Normal)
depth_multiple: 0.75 # Mengurangi kedalaman untuk meningkatkan efisiensi
width_multiple: 1.0 # Menyesuaikan lebar agar lebih efisien
activation: nn.SiLU() # Mengganti ReLU dengan SiLU (Swish) untuk stabilitas gradien

anchors: 3

# YOLOv11 Backbone (optimized with FPN and Depthwise Separable Convolution)
backbone: [
    [-1, 1, nn.Identity, []],

    # conv down with depthwise separable convolution
    [-1, 1, DWConv, [48, 3, 2]], # 1-P1/2

    # conv down with depthwise separable convolution
    [-1, 1, DWConv, [96, 3, 2]], # 2-P2/4

    # Elan-1 block with reduced parameters
    [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]], # 3

    # conv down with depthwise separable convolution
    [-1, 1, DWConv, [192, 3, 2]], # 4-P3/8

    # Elan-2 block with reduced parameters
    [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]], # 5

    # conv down with depthwise separable convolution
    [-1, 1, DWConv, [256, 3, 2]], # 6-P4/16

    # Elan-2 block with reduced parameters
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 7

    # conv down with depthwise separable convolution
    [-1, 1, DWConv, [256, 3, 2]], # 8-P5/32

    # Elan-2 block
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 9
  ]

# YOLOv11 Head yang dioptimalkan dengan FPN dan Spatial Attention
head: [
    # Optimized SPP block with attention for better spatial feature extraction
    [-1, 1, SPPELAN, [256, 128]], # 10

    # up-concat merge
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 7], 1, Concat, [1]], # cat backbone P4

    # Elan-2 block
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 13

    # Spatial Attention added for enhanced focus on important features
    [-1, 1, SpatialAttention, [128]], # Spatial Attention

    # up-concat merge
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P3

    # Elan-2 block
    [-1, 1, RepNCSPELAN4, [192, 192, 96, 1]], # 16 (P3/8-small)

    # conv-down merge
    [-1, 1, Conv, [192, 3, 2]],
    [[-1, 13], 1, Concat, [1]], # cat head P4

    # Elan-2 block
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 19 (P4/16-medium)

    # conv-down merge
    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P5

    # Elan-2 block with Spatial Attention
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 22 (P5/32-large)

    # detect with FPN
    [[16, 19, 22], 1, Detect, [nc]], # Use Detect with FPN for multi-scale detection
  ]
