nc: 4
depth_multiple: 1.0
width_multiple: 1.0
activation: nn.ReLU()

anchors: 3

# YOLOv11 backbone (optimized with Depthwise Separable Convolution)
backbone: [
    [-1, 1, nn.Identity, []],

    # conv down with depthwise separable convolution
    [-1, 1, DWConv, [64, 3, 2]], # 1-P1/2

    # conv down with depthwise separable convolution
    [-1, 1, DWConv, [128, 3, 2]], # 2-P2/4

    # elan-1 block
    [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]], # 3

    # conv down with depthwise separable convolution
    [-1, 1, DWConv, [256, 3, 2]], # 4-P3/8

    # elan-2 block
    [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]], # 5

    # conv down with depthwise separable convolution
    [-1, 1, DWConv, [512, 3, 2]], # 6-P4/16

    # elan-2 block
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]], # 7

    # conv down with depthwise separable convolution
    [-1, 1, DWConv, [512, 3, 2]], # 8-P5/32

    # elan-2 block
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]], # 9
  ]

# YOLOv11 head (optimized)
head: [
    # elan-spp block
    [-1, 1, SPPELAN, [512, 256]], # 10

    # up-concat merge
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 7], 1, Concat, [1]], # cat backbone P4

    # elan-2 block
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]], # 13

    # up-concat merge
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P3

    # elan-2 block
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]], # 16 (P3/8-small)

    # conv-down merge
    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 13], 1, Concat, [1]], # cat head P4

    # elan-2 block
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]], # 19 (P4/16-medium)

    # conv-down merge
    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P5

    # elan-2 block
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]], # 22 (P5/32-large)

    # detect
    [[16, 19, 22], 1, Detect, [nc]], # Use Detect
  ]
